Revit 2027 API
ScheduleFilter Properties
The ScheduleFilter type exposes the following members.
Properties
Name | Description
FieldId |  The ID of the field used to filter the schedule.
FilterType |  The filter type.
IsDoubleValue |  Indicates if the filter has a double value.
IsElementIdValue |  Indicates if the filter has an ElementId value.
IsIntegerValue |  Indicates if the filter has an integer value.
IsNullValue |  Indicates if the filter has no specified value.
IsStringValue |  Indicates if the filter has a string value.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
ScheduleFilter Class
Autodesk.Revit.DB Namespace